@echo off
REM ****************************************
REM コマンドの先頭の @ は、そのコマンドの表示
REM を抑制
REM echo off は以降のコマンドの表示を抑制
REM ****************************************

REM ****************************************
REM サブルーチンの呼び出し
REM ****************************************
call :GetDay 09
if errorlevel 1 ( 
    echo 現在の月は引数と一致しました & date /T
) else ( 
    echo 現在は引数以外の月です & date /T
)

REM ****************************************
REM 処理の終わり
REM ****************************************
goto end

REM ****************************************
REM サブルーチン
REM date /t で 2009/08/16 というような表示を
REM / で区切り REM 2番目の 08 を %%i へセット
REM ****************************************
:GetDay
@for /F "delims=/ tokens=2" %%i in ('date /t') do (
    REM 現在が引数と一致する場合
    if "%%i"=="%1" (
        REM サブルーチンからの脱出と同時に errorlevel のセット
        exit /B 1
    )
)
REM 一致しなかった場合のサブルーチンからの脱出
exit /B 0

REM ****************************************
REM 記述の終わり
REM ****************************************
:end
